//
//  HistoryMockData.swift
//  MentoringProject
//
//  Created by PKW on 2/25/25.
//

import Foundation

struct HistoryMockData {
    static let data: [Double: HistoryModel] = [
        1738368000: HistoryModel(date: "1738368000", wpm: 738, acc: 45, text: "삶이 있는 한 희망은 있다. – 키케로 오늘 최선을 다하면 내일이 달라진다. – 오프라 윈프리", title: "도전의 시작", author: "김철수"),
        1738454400: HistoryModel(date: "1738454400", wpm: 425, acc: 80, text: "성공이란 끊임없이 배우고 도전하는 것이다. – 빌 게이츠", title: "꾸준함의 힘", author: "이영희"),
        1738540800: HistoryModel(date: "1738540800", wpm: 981, acc: 33, text: "미래는 오늘 무엇을 하느냐에 달려 있다. – 마하트마 간디 자신이 할 수 있다고 믿는 순간, 절반은 이루어진 것이다. – 테디 루즈벨트", title: "성공을 향하여", author: "박민수"),
        1738627200: HistoryModel(date: "1738627200", wpm: 597, acc: 92, text: "책을 읽는 것은 미래를 준비하는 것이다. – 간디", title: "꿈과 노력", author: "최지훈"),
        1738713600: HistoryModel(date: "1738713600", wpm: 302, acc: 76, text: "행복한 인생을 살고 싶다면 목표를 가져라. – 알버트 아인슈타인", title: "한 걸음씩", author: "정유진"),
        1738800000: HistoryModel(date: "1738800000", wpm: 849, acc: 21, text: "용기는 공포를 정복하는 것이다. – 넬슨 만델라 모든 위대한 일은 작은 시작에서 출발한다. – 시저", title: "도전의 시작", author: "김철수"),
        1738886400: HistoryModel(date: "1738886400", wpm: 113, acc: 88, text: "성공의 열쇠는 끊임없는 노력이다. – 나폴레옹 힐", title: "꾸준함의 힘", author: "이영희"),
        1738972800: HistoryModel(date: "1738972800", wpm: 692, acc: 41, text: "우리는 변화해야 한다, 그렇지 않으면 성장할 수 없다. – 존 맥스웰", title: "성공을 향하여", author: "박민수"),
        1739059200: HistoryModel(date: "1739059200", wpm: 774, acc: 99, text: "오늘이 가장 좋은 시간이다. – 달라이 라마", title: "꿈과 노력", author: "최지훈"),
        1739145600: HistoryModel(date: "1739145600", wpm: 321, acc: 57, text: "자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트", title: "한 걸음씩", author: "정유진"),
        1739232000: HistoryModel(date: "1739232000", wpm: 814, acc: 34, text: "실패를 두려워하면 아무것도 이룰 수 없다. – 마이클 조던", title: "성장의 과정", author: "김철수"),
        1739318400: HistoryModel(date: "1739318400", wpm: 237, acc: 69, text: "위대한 목표를 설정하고 그것을 이루기 위해 매일 노력하라. – 스티브 잡스", title: "포기하지 않는 마음", author: "이영희"),
        1739404800: HistoryModel(date: "1739404800", wpm: 569, acc: 72, text: "무엇을 하든지 최선을 다하라. – 유비", title: "태도의 중요성", author: "박민수"),
        1739491200: HistoryModel(date: "1739491200", wpm: 389, acc: 98, text: "실패는 성공을 위한 디딤돌이다. – 에디슨", title: "새로운 시작", author: "최지훈"),
        1739577600: HistoryModel(date: "1739577600", wpm: 472, acc: 55, text: "지금이 가장 좋은 시간이다. – 달라이 라마", title: "현재의 소중함", author: "정유진"),
        1739664000: HistoryModel(date: "1739664000", wpm: 684, acc: 31, text: "행복은 습관이다, 그것을 몸에 지녀라. – 허버트", title: "의미 있는 하루", author: "김철수"),
        1739750400: HistoryModel(date: "1739750400", wpm: 299, acc: 84, text: "모든 위대한 일은 작은 시작에서 출발한다. – 시저", title: "행복의 비결", author: "이영희"),
        1739836800: HistoryModel(date: "1739836800", wpm: 726, acc: 77, text: "오늘 최선을 다하면 내일이 달라진다. – 오프라 윈프리", title: "자신감의 힘", author: "박민수"),
        1739923200: HistoryModel(date: "1739923200", wpm: 341, acc: 99, text: "자신이 할 수 있다고 믿는 순간, 절반은 이루어진 것이다. – 테디 루즈벨트", title: "인생의 의미", author: "최지훈"),
        1740009600: HistoryModel(date: "1740009600", wpm: 497, acc: 66, text: "시작이 반이다. – 아리스토텔레스", title: "긍정의 힘", author: "정유진"),
        1740096000: HistoryModel(date: "1740096000", wpm: 888, acc: 23, text: "미래는 오늘 무엇을 하느냐에 달려 있다. – 마하트마 간디", title: "최선의 노력", author: "김철수"),
        1740182400: HistoryModel(date: "1740182400", wpm: 152, acc: 75, text: "오늘을 특별하게 만드는 것은 우리의 태도이다. – 박민수", title: "웃음의 중요성", author: "이영희"),
        1740268800: HistoryModel(date: "1740268800", wpm: 814, acc: 34, text: "실패를 두려워하면 아무것도 이룰 수 없다. – 마이클 조던", title: "성장의 과정", author: "김철수"),
        1740355200: HistoryModel(date: "1740355200", wpm: 389, acc: 98, text: "실패는 성공을 위한 디딤돌이다. – 에디슨", title: "새로운 시작", author: "최지훈"),
        1740441600: HistoryModel(date: "1740441600", wpm: 302, acc: 76, text: "행복한 인생을 살고 싶다면 목표를 가져라. – 알버트 아인슈타인", title: "한 걸음씩", author: "정유진"),
        1740528000: HistoryModel(date: "1740528000", wpm: 981, acc: 33, text: "미래는 오늘 무엇을 하느냐에 달려 있다. – 마하트마 간디 자신이 할 수 있다고 믿는 순간, 절반은 이루어진 것이다. – 테디 루즈벨트", title: "성공을 향하여", author: "박민수"),
        1740614400: HistoryModel(date: "1740614400", wpm: 113, acc: 88, text: "성공의 열쇠는 끊임없는 노력이다. – 나폴레옹 힐", title: "꾸준함의 힘", author: "이영희"),
        1740700800: HistoryModel(date: "1740700800", wpm: 321, acc: 57, text: "자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트 자신을 믿어라, 그러면 불가능이 가능해진다. – 엘리너 루즈벨트", title: "한 걸음씩", author: "정유진"),
    ]
}
